app/views/events/_form.html.erb

SELECT "places".* FROM "places"
---
    Venue: <br>
    <%= form.collection_select(:place, Place.all, :id, :name) %><br>