app/views/events/index.html.erb

        <td><%= event["start_date"] %></td>
        <td><%= Place.find(event.place_id).name %></td>
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]