app/views/events/show.html.erb

	Tickets:<br>
	<%= form.collection_select(:ticket, Ticket.where(event_id: @event[:id]), :id, :description) %>
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? ORDER BY "tickets"."id" ASC LIMIT ?  [["event_id", 1], ["LIMIT", 1]]