app/views/tickets/_form.html.erb

  Event: <br>
  <%= form.collection_select(:event, Event.all, :id, :name) %><br>
---
SELECT "events".* FROM "events"