app/controllers/events_controller.rb

  def index
    #@events = list_events
    @events = Event.all
---
SELECT "events".* FROM "events"

  def show
    @event = Event.find(params[:id])
    @place = Place.find(@event[:place_id])
    @tickets = Ticket.where(event: @event)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? ORDER BY "tickets"."id" ASC LIMIT ?  [["event_id", 1], ["LIMIT", 1]]

  def create
    ticket_place = Place.find(event_params["place"])
    ev_params = {}
    ev_params[:name] = event_params[:name]
    ev_params[:description] = event_params[:description]
    ev_params[:start_date] = event_params[:start_date]
    ev_params[:place] = ticket_place
    @event = Event.new(ev_params)

    respond_to do |format|
      if @event.save
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)