app/controllers/sessions_controller.rb

	def new
		user = User.find(session["warden.user.user.key"][0][0])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		user = User.where(email: user_params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "jatellez@miuandes.cl"], ["LIMIT", 1]]