app/controllers/tickets_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tickets" ("description", "price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Platea Alta"], ["price", 50000], ["event_id", 2], ["created_at", "2019-05-23 19:20:30.585784"], ["updated_at", "2019-05-23 19:20:30.585784"]]
---
  def create
    event = Event.find(ticket_params["event"])
    t_params = {}
    t_params[:description] = ticket_params[:description]
    t_params[:price] = ticket_params[:price]
    t_params[:event] = event

    @ticket = Ticket.new(t_params)

    respond_to do |format|
      if @ticket.save