app/controllers/user_tickets_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "user_tickets" ("user_id", "ticket_id", "time", "n_bought", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["ticket_id", 7], ["time", "2019-05-25 21:43:26.838264"], ["n_bought", 2], ["created_at", "2019-05-25 21:43:26.841255"], ["updated_at", "2019-05-25 21:43:26.841255"]]
---
  def create
    #us_tickets = []
    #user_ticket_params[:number_of_tickets].to_i.times do
    ticket = Ticket.find(user_ticket_params[:ticket])
    user = User.find(session["warden.user.user.key"][0][0])
    ut_params = {user: user, ticket: ticket, time: DateTime.now(), n_bought: user_ticket_params[:n_bought].to_i }
    #us_tickets << ut_params
    #end
    @user_ticket = UserTicket.new(ut_params)

    respond_to do |format|
      if @user_ticket.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."paid" IS NULL AND "user_tickets"."user_id" = ?  [["user_id", 3]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "user_tickets" SET "paid" = ?, "current" = ?, "updated_at" = ? WHERE "user_tickets"."id" = ?  [["paid", "t"], ["current", "t"], ["updated_at", "2019-05-25 23:28:19.586966"], ["id", 1]]
---
  def update_all
    #render json: {us: @user_tickets}
    user = User.find(session["warden.user.user.key"][0][0])
    tickets = UserTicket.where(paid: nil).where(user: user)
    tickets.each do |ticket|
      ticket.update(current: true)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."current" = ? AND "user_tickets"."user_id" = ?  [["current", "t"], ["user_id", 3]]
UPDATE "user_tickets" SET "current" = ?, "paid" = ?, "updated_at" = ? WHERE "user_tickets"."id" = ?  [["current", "f"], ["paid", "t"], ["updated_at", "2019-05-25 23:42:18.966341"], ["id", 9]]
---
  def update_all_confirm
    #render json: {us: @user_tickets}
    user = User.find(session["warden.user.user.key"][0][0])
    tickets = UserTicket.where(current: true).where(user: user)
    tickets.each do |ticket|
      ticket.update(current: false, paid: true)

SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."paid" IS NULL AND "user_tickets"."user_id" = ?  [["user_id", 3]]
---
    def set_user_ticket
      @user_ticket = UserTicket.find(params[:id])