app/controllers/user_tickets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    user = User.find(session["warden.user.user.key"][0][0])